# QiuChenly 计算数据差值做特征码算法
# 部分网友提供了原始版本 虽然是用的Chatgpt写给我的 但是还是略表谢意
# 提供不定长度的多个十六进制汇编代码段 自动求出差值特征码

data = """
F4 4F BE A9 FD 7B 01 A9 FD 43 00 91 F3 03 00 AA C1 DA 00 90 21 AC 2A 91 9E 5C 48 94 00 05 00 34 C1 DA 00 90 21 EC 2A 91 E0 03 13 AA 99 5C 48 94 A0 04 00 34 C1 DA 00 90 21 3C 2B 91 E0 03 13 AA 94 5C 48 94 40 04 00 34 C1 DA 00 90 21 78 2B 91 E0 03 13 AA 8F 5C 48 94 E0 03 00 34 C1 DA 00 90 21 D0 2B 91 E0 03 13 AA 8A 5C 48 94 E0 03 00 34 C1 DA 00 90 21 18 2C 91 E0 03 13 AA 85 5C 48 94 E0 02 00 34 C1 DA 00 90 21 84 2C 91 E0 03 13 AA 80 5C 48 94 80 02 00 34 C1 DA 00 90 21 C0 2C 91 E0 03 13 AA 7B 5C 48 94 48 01 80 52 09 33 80 52 1F 00 00 71 20 01 88 1A 0C 00 00 14 40 32 80 52 0A 00 00 14 60 32 80 52 08 00 00 14 80 32 80 52 06 00 00 14 A0 32 80 52 04 00 00 14 C0 32 80 52 02 00 00 14 E0 32 80 52 FD 7B 41 A9 F4 4F C2 A8 C0 03 5F D6 FD 7B BF A9 FD 03 00 91


FF 03 01 D1 F6 57 01 A9 F4 4F 02 A9 FD 7B 03 A9 FD C3 00 91 F4 03 01 AA F5 03 00 AA F3 03 08 AA E0 03 00 91 41 32 80 52 2C F6 FF 97 E8 07 40 F9 E9 03 40 B9 1F 01 14 EB 20 01 55 7A A0 02 00 54 E0 03 00 91 61 32 80 52 24 F6 FF 97 E8 07 40 F9 E9 03 40 B9 1F 01 14 EB 20 01 55 7A 00 02 00 54 E0 03 00 91 81 32 80 52 1C F6 FF 97 E8 07 40 F9 1F 01 14 EB 61 02 00 54 E8 03 40 B9 1F 01 15 6B 01 02 00 54 C1 ED 00 F0 21 7C 18 91 06 00 00 14 C1 ED 00 F0 21 EC 17 91 03 00 00 14 C1 ED 00 F0 21 2C 18 91 E0 03 13 AA 90 F0 FF 97 FD 7B 43 A9 F4 4F 42 A9 F6 57 41 A9 FF 03 01 91
"""

data1 = []

for i in data.split("\n"):
    if i == "":
        continue
    else:
        data1.append(i)
        if len(data1) > 1:
            res = " ".join(
                [
                    d1 if d1 == d2 else "??"
                    for d1, d2 in zip(data1[0].split(), data1[1].split())
                ]
            )
            data1 = [res]

print(data1[0])
